{"country":"England","result_count":292,"area_name":"","listing":[{"num_floors":"0","listing_status":"sale","num_bedrooms":"5","latitude":53.62497,"agent_address":"54 John William Street","property_type":"Cottage","longitude":-1.754073,"thumbnail_url":"http://li.zoocdn.com/5c8a53ae268c6a09d09dbb2e53c8b5b321c7496b_80_60.jpg","description":"A rare opportunity has arisen in this stunning semi rural position located in the foothills of Castle Hill and its surrounding countryside whilst also being well placed to take advantage of Almondbury village centre and regarding local schooling. With a meadow style paddock to the rear of approx 0.5 acres. The property provides the lucky purchaser with a variety of potential end uses (subject to necessary consents). Must be viewed to be appreciated. Briefly comprising: Lounge, sitting room, dining room, library, study, 2 breakfast/dining kitchens, wc, utility room, 5 bedrooms, dressing area, bathroom, wc, potential additional shower room, established gardens, attached single garage and paddock to the rear. Gas fired central heating system and partial double glazing. EPC rating D.From the rear of the propertyA centrally positioned access door leads into:Rear hallway 11'11' x 4'3' (3.63m x 1.30m)With French doors leading to a dining room, an internal door leading into a breakfast/dining kitchen, access to a useful understairs storage cupboard space and the cloakroom/wc:Cloakroom/WC (towards the rear)Having a low flush wc and corner hand wash basin, tiled walls and central heating radiator.Kitchen (towards the rear) 15'10' x 8'9' (4.83m x 2.67m)A day to day room which enjoys ample natural light with windows positioned to the rear and side elevations. There are a range of fitted wall and base units with oak style door fronts, part tiled splashbacks, working surfaces incorporating a twin stainless steel inset sink unit along with 4 ring gas hob, separate fitted double oven and grill, plumbing for an automatic washing machine, integrated fridge and freezer, breakfast bar with additional fold out extension and an arched Georgian style window allowing borrowed natural light from the kitchen and through to the sitting room. Both of the main windows enjoy an attractive aspect over the surrounding countryside and gardens.Formal dining room (towards the front) 11'3' x 8'0' (3.43m x 2.44m)With aforementioned French doors from the hall, an internal door leading to a front entrance lobby and a further decorative feature arch leading to the living room which is also positioned towards the front of the property. To the front elevation is a raised bay style window enjoying a pleasant outlook over the front garden, offering a good degree of privacy.Living room (towards the front) 16'0' x 11'3' (4.88m x 3.43m)Accessed through aforementioned feature arch. This room enjoys ample natural light through the sliding patio doors that allow access to the front garden and the exterior property. There is a Living Flame gas fire with marble back/inset, ornate surround, decorative coving, provision for 2 wall lights, 2 central heating radiators and the aforementioned internal Georgian style window allows natural light to pass between the kitchen and living room.Entrance lobby (being centrally positioned at the front)(Formerly the entrance lobby for No 2). Having a staircase allowing access to the first floor. Also providing passage to the dining room and sitting room.Sitting room (towards the front) 16.10 x 13.9 mx (52'10' x 45'7' mx)Having a bay window overlooking the garden to the front elevation, 2 central heating radiators, a delft rack, an open fire in an English 'Clay Gate' design and decorative coving.Library (towards the front) 16.9 x 13.8 mx (55'5' x 45'3' mx)Having an attractive bay window towards the front elevation, 2 central heating radiators and a delft rack. The focal point for the library is a period styled Living Flame gas fire in an orrnate Adams style with marble insets and hearth. There is provision for 3 wall mounted lights.Internal vestibuleInternal vestibule which gives further access to a dining kitchen which is towards the rear of the property and a study which is towards the front. There is further useful cupboard storage space.Dining kitchen (towards the rear) 14'9' x 10'0' (4.50m x 3.05m)Fitted with a range of oak style wall and base units with complementary working surfaces incorporating a 1¾ stainless steel inset sink unit, 4 ring gas hob with extractor over, fitted double oven, complementary mosaic style tiled splashback, quarry tiled floor, timber framed single glazed windows the rear elevation and an open plan doorway leads to a:Utility room (to the rear) 6'0' x 5'9' (1.83m x 1.75m)Having a waste pipe for the washing machine, decorative dado, timber framed double glazed windows to the rear elevation and a folding louvre door allows access to the:Boiler roomHousing a Gloworm base level boiler and cylinder in addition to the hot and cold water feeds for the utility room (washing machine). Fuse box. Small loft hatch allowing access to the roof void above the kitchen/diner and utility.Study/office (towards the front) 15'9' x 7'5' (4.80m x 2.26m)Having a timber framed double glazed window to the front elevation enjoying distant views towards the Farnley Line and Woodsome Valley beyond. Delft rack, central heating radiator and an internal door leading towards a:Front entrance lobbyFormerly the access for No 4. Having a staircase allowing passage to the first floor.First floorBedroom (to the front) 10'2' max x 14'0' max (3.10m max x 4.27m max)Having a bulk head shelving area, timber framed double glazed windows to the front elevation enjoying the aforementioned views, decorative coving and central heating radiator.Former bathroom/shower room (towards the rear) 7'11' x 5'5' (2.41m x 1.65m)With capped off services in place. Timber framed double glazed box sash style window to the rear elevation enjoying a pleasant outlook over the surrounding countryside.LandingGalleried style landing area with spindles, balustrade and newel posts, single glazed box sash style window to the rear elevation enjoying the aforementioned views, central heating radiator and an internal door leads into:Through bedroom 16'11' x 10'10' average (5.16m x 3.30m average)Having 2 central heating radiators, a timber framed double glazed window to the front elevation and a double glazed box sash style window to the rear elevation, both of which enjoy the views of the surrounding area.Study/hall (towards the rear) 11'3' x 7'10' (3.43m x 2.39m)Potential for use as a dressing area. Having a radiator and timber framed double glazed box sash window to the rear elevation.LandingHaving single glazed box sash timber framed window to the rear elevation, spindles, balustrade and newel posts at the top of the staircase and a loft hatch allowing access to the room space, central heating radiator, 2 useful linen cupboard and an airing cupboard housing the Vokera boiler, both with further cupboard storage above.Bedroom (towards the front) 16'10' x 8'7' max (5.13m x 2.62m max)With maple style laminate flooring, 2 single glazed windows to the front elevation, central heating radiator, decorative coving and bulk head shelved area.House bathroom (towards the front) 9'6' x 7'11' (2.90m x 2.41m)Having a corner sunken style bath, shower cubicle, vanity hand wash basin with useful cupboard and drawer storage and display tops, central heating radiator, tiled walls, coving and single glazed timber framed window to the front elevation.WC (towards the rear)Fitted with a low level wc and pedestal wash hand basin. A timber framed double glazed window to the rear elevation, central heating radiator and predominantly tiled walls.Bedroom (towards the front) 16'0 max or 14'1' to robe doors x 11'4' (4.88m maxHaving a range of fitted bedroom furniture comprising 3 double wardrobes with additional dresser drawers and further cupboard storage above. Central heating radiator and timber framed single glazed windows to the front elevation.Bedroom (towards the rear) 15'9' max x 8'11' (4.80m max x 2.72m)Having timber framed double glazed windows to the rear and side elevation both of which enjoy the attractive outlook over the established surrounding countryside and gardens.OutsideTo the rear is a tarmacadam driveway with turning areas, attached single garage, elevated gardens, patio seating areas. An established front gardens offering a good degree of privacy and the paddock area towards the rear can be identified on the plan which highlights the curtilage.PlanNot to scale. For identification purposes only.Rear elevationEPC rating DAs/db/06.15DirectionsThe property will be found in a corner position on the junction of Sharp Lane and Lumb Lane.ViewingStrictly by arrangement with Boultons Estate Agents. Please telephone to book an appointment.You may download, store and use the material for your own personal use and research. You may not republish, retransmit, redistribute or otherwise make the material available to any party or make the same available on any website, online service or bulletin board of your own or of any other party or make the same available in hard copy or in any other media without the website owner's express prior written consent. The website owner's copyright must remain on all reproductions of material taken from this website.","post_town":"Huddersfield","details_url":"http://www.zoopla.co.uk/for-sale/details/37256131?utm_source=v1:566VH2_dD0bf_EasfuFyojT1JRQ6zbae&utm_medium=api","short_description":"A rare opportunity has arisen in this stunning semi rural position located in the foothills of Castle Hill and its surrounding countryside whilst also being well placed to take advantage of Almondbury village centre and regarding local schooling. With a meadow style paddock to the rear of approx 0.5 acres. The property provides the lucky purchaser with a variety of potential end uses (subject to necessary consents). Must be viewed to be appreciated. Briefly comprising: Lounge, sitting room, dining room, library, study, 2 breakfast/dining kitchens, wc, utility room, 5 bedrooms, dressing area, bathroom, wc, potential additional shower room, established gardens, attached single garage and paddock to the rear. Gas fired central heating system and partial double glazing. EPC rating D.","outcode":"HD4","county":"West Yorkshire","price":"400000","listing_id":"37256131","image_caption":"","status":"for_sale","agent_name":"Boultons","num_recepts":"4","country":"England","displayable_address":"2 - 4, Lumb Lane, Almondbury, Huddersfield HD4","first_published_date":"2015-06-19 13:17:59","floor_plan":["http://lc.zoocdn.com/b3947e8b094981900e27445a5e1d5a8d6a848288.jpg"],"street_name":"Lumb Lane","num_bathrooms":"1","price_change":[{"direction":"","date":"2015-06-19 12:17:00","percent":"0%","price":"350000.00"},{"direction":"up","date":"2015-07-24 12:41:37","percent":"14.2%","price":"400000.00"}],"agent_logo":"http://st.zoocdn.com/zoopla_static_agent_logo_(276059).png","agent_phone":"01484 973995","image_url":"http://li.zoocdn.com/5c8a53ae268c6a09d09dbb2e53c8b5b321c7496b_354_255.jpg","last_published_date":"2015-11-18 17:55:09","price_change_summary":{"direction":"up","percent":"14.2%","last_updated_date":"2015-07-24 12:41:37"}},{"num_floors":"0","listing_status":"sale","num_bedrooms":"5","latitude":52.646847,"agent_address":"6 Beacon House, Turbine Road","property_type":"Detached house","longitude":0.81895,"thumbnail_url":"http://li.zoocdn.com/8fd8ef19b9c4b1721bdec59fc713de362ef0b62e_80_60.jpg","description":"Full of character a previously extended detached five bedroom period property including: Two bedroom self contained annexe, situated in rural Norfolk.This property comes with a double garage and sits on a plot approaching 1 acre (stms), additional land is available to purchase if desired!With three bedrooms and two reception rooms in the main cottage and a self contained two bedroom annexe with two reception rooms, separate kitchen, bathroom and cloakroom, the accommodation is flexible and offers many options. The annexe currently provides a regular rental income for the present owner.Briefly, the property comprises - Entrance hall, inner lobby, lounge, sitting room, kitchen/diner, conservatory, utility room, three bedrooms (main building), bathroom, Annexe - entrance hall, lounge, kitchen, dining room, two bedrooms and bathroom. Driveway with parking and large rear garden, plot size approaching 1 acre (stms)There is good road access to the nearby villages of Shipdham and Necton, both offering a good range of amenities. With the nearby market town of Swaffham offering a wealth of amenities including a Waitrose supermarket, a good selection of shops, pubs and restaurants, three doctors surgeries and free parking throughout the town.Entrance Hall - 14'3\" (4.34m) x 8'7\" (2.62m)UPVC entrance door, fitted carpet, two UPVC double glazed windows to front aspect, radiator, stairs to first floor landing.Inner Lobby - 9'11\" (3.02m) x 6'3\" (1.9m)UPVC double glazed doors to front aspect, fitted carpet, radiator.Sitting Room - 19'1\" (5.82m) x 15'1\" (4.6m)Large log burner set within charming brick inglenook fireplace with timber mantle over and pamment tiles to hearth, exposed timber beams to ceiling, fitted carpet, two radiators.Lounge - 15'4\" (4.67m) x 13'8\" (4.17m)Door opening to conservatory, exposed timber beams to ceiling, fitted carpet, UPVC double glazed window looking out to conservatory, discreet cupboard housing oil fired central heating boiler, two radiators.Conservatory - 12'11\" (3.94m) x 10'8\" (3.25m)UPVC double glazed conservatory sitting on low level cavity wall, wood effect laminate flooring, UPVC double glazed door to rear garden.Kitchen/Diner - 14'2\" (4.32m) x 8'7\" (2.62m)Fitted kitchen units to wall and floor with laminate work surface over, stainless steel sink unit with mixer tap and integrated drainer, fitted cupboards, UPVC double glazed window to rear aspect, radiator.Utility - 6'5\" (1.96m) x 5'11\" (1.8m)Fitted kitchen unit to floor floor with laminate work surface over, stainless steel sink unit with integrated drainer, UPVC double glazed window to front aspect, vinyl flooring.Cloakroom - 6'7\" (2.01m) x 5'8\" (1.73m)White suite comprising - hand wash basin, WC, UPVC obscure glass double glazed window to side aspect.Stairs and LandingFitted carpet.Bedroom One - 14'10\" (4.52m) x 10'3\" (3.12m)Fitted wardrobes, fitted carpet, UPVC double glazed window to rear aspect, wash basin with cabinet below, radiator.Bedroom Two - 13'6\" (4.11m) x 11'6\" (3.51m)Built in cupboard, two UPVC double glazed windows to rear aspect, feature fireplace, fitted carpet, airing cupboard housing hot water cylinder, radiator.Bedroom Three - 15'8\" (4.78m) Into Wardrobe Recess x 7'10\" (2.39m)Built in wardrobe, fitted carpet, UPVC double glazed window to rear aspect, radiator.Bathroom - 6'10\" (2.08m) x 6'7\" (2.01m)White suite comprising - bath with shower over and shower screen, wash basin with cabinet below, WC, fitted carpet, UPVC double glazed obscure glass window to front aspect, radiator and heated towel rail.Annexe -Entrance HallSeperate entrance door leading into the annexe, fitted carpet.Inner LobbyFitted carpet, storage cupboard, stairs to first floor landing, doors to cloakroom and bathroom.Kitchen/Breakfast Room - 11'8\" (3.56m) Max x 11'2\" (3.4m)Matching wall and floor units with laminate work surface over, electric cooker point, stainless steel sink and drainer, plumbing and space for washing machine, UPVC double glazed windows to front and side aspects.Dining Area - 12'8\" (3.86m) x 6'0\" (1.83m)Fitted carpet, UPVC double glazed window to side aspect, storage cupboard, storage heater.Lounge - 15'8\" (4.78m) x 11'5\" (3.48m)Fitted carpet, storage cupboard, sliding patio doors to rear aspect, storage heater.Stairs and LandingFitted carpet, airing cupboard.Bedroom One - 14'10\" (4.52m) x 7'0\" (2.13m)Fitted carpet, UPVC double glazed window to rear aspect, storage heater.Bedroom Two - 8'5\" (2.57m) x 7'0\" (2.13m)Fitted carpet, UPVC double glazed window to rear aspect, storage heater.BathroomSuite comprising - bath with electric shower over, hand wash basin and pedestal, WC, UPVC double glazed obscure glass window to front aspect, heated towel rail.Double Garage - 18'8\" (5.69m) x 18'4\" (5.59m)Up and over doors, power and lighting.Outside - FrontIron gates opening onto shingle parking area leading to double garage, covered terrace with raised flower beds, gated access to rear garden.Outside - RearLaid to lawn with established trees, shrubs, conifers and trees to boundary, paved patio seating area. Extra adjoining land available to purchase if required.NoticePlease note we have not tested any apparatus, fixtures, fittings, or services. Interested parties must undertake their own investigation into the working order of these items. All measurements are approximate and photographs provided for guidance only.","post_town":"Thetford","details_url":"http://www.zoopla.co.uk/for-sale/details/34813068?utm_source=v1:566VH2_dD0bf_EasfuFyojT1JRQ6zbae&utm_medium=api","short_description":"A detached 5 bedroom period property including 2 bedroom self contained annexe and double garage sitting on a plot approaching 1 acre (stms) situated in rural Norfolk. Ideal for extended family or just as the current owner - receive an additional rental income. Extra land available if desired.","outcode":"IP25","county":"Norfolk","price":"400000","listing_id":"34813068","image_caption":"","status":"for_sale","agent_name":"Longsons","num_recepts":"4","country":"England","displayable_address":"West End, Bradenham, Thetford, Norfolk IP25","first_published_date":"2015-03-16 13:27:14","price_modifier":"offers_in_region_of","floor_plan":["http://lc.zoocdn.com/04e3c854c064e2f9c54dba87bf55501b129ba718.jpg"],"street_name":"West End Bradenham","num_bathrooms":"2","price_change":[{"direction":"","date":"2015-03-16 12:24:36","percent":"0%","price":"400000.00"}],"agent_logo":"http://st.zoocdn.com/zoopla_static_agent_logo_(243017).png","agent_phone":"01760 358002","image_url":"http://li.zoocdn.com/8fd8ef19b9c4b1721bdec59fc713de362ef0b62e_354_255.jpg","last_published_date":"2015-11-23 23:38:14"},{"num_floors":"0","listing_status":"sale","num_bedrooms":"5","latitude":52.813038,"agent_address":"69 Derby Road","property_type":"Farmhouse","longitude":-1.792897,"thumbnail_url":"http://li.zoocdn.com/39ef3e95e9dc7793274145df9b18870de28455b8_80_60.jpg","description":"Location:Dolesfoot farmhouse stands in a particularly pleasant and attractive rural location setting between Newborough, Hoar Cross and Newchurch standing on a little used country lane. The property stands approximately 3/4 of a mile from the A515 which offers quick and easy access to the nearby villages of Yoxall and Barton under Needwood together with the A38.The location is also very accessible for Lichfield, Burton on Trent and Uttoxeter.Lichfield - 12 milesBurton on Trent - 7 milesUttoxeter - 9 milesDirections:From the A515 northbound from Lichfield, proceed through the villages of Kings Bromley and Yoxall and having left Yoxall, continue for a further 2.5 miles and having reached the hamlet of Newchurch take the next acute turning on your left (at the minor crossroads) onto Dolesfoot Lane.Follow the lane for approximately 3/4 of a mile and the farmhouse is then situated on your right hand side.Description:A fascinating and sizeable Period farmhouse in a particularly attractive and convenient location. The property offers generous accommodation set over three levels with the rear part of the property offering cottage style accommodation with the front being a Victorian addition.Complemented by good sized gardens, the property briefly comprises entrance hall, four reception rooms, kitchen, pantry and at first floor level; five bedrooms and two attic rooms.Externally there are gardens extending to the side and rear and there is consent to install a new driveway to the eastern end of the plot.Entrance Door:Opening ontoEntrance Hall:With attractive spindle staircase to first floor and access to cellar.Living Room:5.44m x 4.83m (17'10'') x (15'10'')With two wall light points, UPVC double glazed windows to front and side, Victorian fireplace with tiled inserts and cornice detail to ceiling.Sitting Room/Snug:4.75m x 3.73m (15'7'') x (12'3'')With ceramic tiled fireplace and adjacent built in cupboards set into an inglenook, concealed doorway through to fourth living room, beams to ceiling and double glazed window to rear.Kitchen:4.83m x 3.66m (15'10'') x (12')With Oak fronted base and wall mounted units, stainless steel sink, quarry tiled floor and appliance space. Window and door to side.Pantry:3.53m x 2.9m (11'7' x 9'6'')With brick paved floor.Lounge:5.46m x 4.98m (17'11'') x (16'4'')With UPVC double glazed window to front with original shutters, coving detail to ceiling, fireplace with cast inserts, radiator and door to -Second Sitting Room:4.8m x 3.78m (15'9''x 12'5'')With concealed door to snug and window to rear and further door to-Lean To Conservatory:4.75m x 3.23m (15'7'' x 10'7'')With side door to garden.At First Floor Level:Main Landing:With window to front.Bedroom One:5.49m x 4.67m (18'x 15'4'')With cast fireplace and UPVC double glazed window to front.Bedroom Two:5.46m x 4.67m (17'11'' x 15'4'')With UPVC double glazed window to front and fireplace.Rear LandingBedroom Three:4.83m x 3.76m (15'10'' x 12'4'')With window to rear and fireplace.Bathroom:4.39m x 3.73m (14'5''x 12'3'')With three piece suite in white comprising bath, W.C. And wash hand basin with shower over bath and tiled splash back and built in airing cupboard.Bedroom Four:4.88m x 3.71m (16' x 12'2'')With window to side and connecting door to inner lobby giving access toBedroom Five:3.51m x 2.87m (11'6'' x 9'5'')With window to rear.At Second Floor Level:Landing:Attic Room One:4.09m (13'5'' x 12')With window to front and storage cupboard/loft off.Attic Room Two:3.96m x 3.63m (13' x 11'11'')With storage cupboard/loft off.Externally:The property enjoys a good sized garden extending to the side and rear which is predominantly laid to grass with some established trees and shrubs.There is a large natural pond which is currently fed from neighbouring surface water which cannot be guaranteed.Local Authority:Lichfield District CouncilDistrict Council HouseFrog LaneLichfieldWS13 6YYTel:Council Tax:The Council Tax is believed to be within band 'F'.Services:Mains water and electricity are connected. Drainage is private.Rights of Way, Wayleaves and Easements:A - The garden pond is currently fed with surface water from the neighbouring property and by agreement this can continue or the surface water can be diverted.B - The mains water supply currently runs under part of the garden and this serves neighbouring property.C - The septic tank to the property currently lies to the front on a grassed area adjacent to the road with a soakaway onto adjacent fields for which there will be an easement granted.D - The current driveway to the property will provide pedestrian access only. Consent for a new driveway has been obtained to the east side of the property.The property is sold subject to and with the benefit of all rights of way, wayleaves and easements in existence at the time of the sale.Energy Performance Certificate:EPC rating G.Tenure and Possession:The property is Freehold with vacant possession upon completion.Agents Note:Messrs. Bagshaws have made every reasonable effort on behalf of their client to ensure these details offer an accurate and fair description of the property but give notice that:1 All measurements, distances and areas referred to are approximate and based on information available at the time of printing2 Fixtures, fittings and any appliances referred to in these details have not been tested or checked and any reference to rights of way, easements, wayleaves, tenure or any other covenants/conditions should be verified by the buyer¿s legal representative prior to exchanging contracts.3 Photographs, plans and maps are indicative only and it should not be assumed that anything shown in these is included in the sale4 These details are for guidance only and do not constitute part of the contract for sale. Bagshaws and their employees are not authorised to give any warranties or representatives (written or oral) in relation to the sale. Buyers are advised to seek clarification on any points of particular interest, prior to pursuing their interest in this property.5 Alterations to the details may be necessary during the marketing.","post_town":"Burton-on-Trent","details_url":"http://www.zoopla.co.uk/for-sale/details/37766505?utm_source=v1:566VH2_dD0bf_EasfuFyojT1JRQ6zbae&utm_medium=api","short_description":"A fascinating and sizeable Period farmhouse in a particularly attractive and convenient location. Guide Price - £400,000 - £450,000","outcode":"DE13","county":"Staffordshire","price":"400000","listing_id":"37766505","image_caption":"","status":"for_sale","agent_name":"Bagshaws","num_recepts":"0","country":"England","displayable_address":"Dolesfoot Lane, Newborough DE13","first_published_date":"2015-08-12 09:30:02","price_modifier":"offers_over","floor_plan":["http://lc.zoocdn.com/ae90b840c4a42cb185f8f971e806a9301ab520ff.jpg"],"street_name":"Dolesfoot Lane","num_bathrooms":"1","price_change":[{"direction":"","date":"2015-08-12 09:29:06","percent":"0%","price":"500000.00"},{"direction":"down","date":"2015-10-29 16:09:07","percent":"-20%","price":"400000.00"}],"agent_logo":"http://st.zoocdn.com/zoopla_static_agent_logo_(295711).png","agent_phone":"01889 735958","image_url":"http://li.zoocdn.com/39ef3e95e9dc7793274145df9b18870de28455b8_354_255.jpg","last_published_date":"2015-11-18 18:19:51","price_change_summary":{"direction":"down","percent":"-20%","last_updated_date":"2015-10-29 16:09:07"}}],"street":"","town":"","county":"","postcode":""}